[
  {
    "bookId": 1,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://iili.io/Jhp5LzJ.png",
    "review": "An enchanting narrative chronicling the unexpected journey of a humble hobbit amidst perilous lands, encountering mystical creatures, and ultimately confronting the formidable dragon guarding a coveted treasure. Tolkien's masterful storytelling unfolds a captivating tale of courage, friendship, and the triumph of the unlikely hero.",
    "totalPages": 310,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["adventure", "fantasy", "dragon"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 2,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://iili.io/Jhp7GIa.png",
    "review": "Coelho weaves a profound tapestry of introspection and destiny as a shepherd embarks on a transformative odyssey to realize his personal legend. Through vivid prose and allegorical motifs, the novel imparts timeless wisdom on embracing one's dreams, navigating life's uncertainties, and discovering the true essence of fulfillment.",
    "totalPages": 197,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["philosophical", "journey", "personal legend"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 3,
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://iili.io/Jhp7bQj.png",
    "review": "Brown delivers an electrifying thriller where symbology intertwines with ancient secrets, leading symbologist Robert Langdon on a pulse-pounding quest to unravel cryptic puzzles and uncover hidden truths. With relentless suspense and intricate plot twists, the novel immerses readers in a labyrinth of intrigue and conspiracy.",
    "totalPages": 454,
    "rating": 4.2,
    "category": "Mystery",
    "tags": ["thriller", "symbology", "secret societies"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2003
  },
  {
    "bookId": 4,
    "bookName": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "https://iili.io/JhpYXwu.png",
    "review": "Collins crafts a chilling dystopian panorama where survival becomes a harrowing spectacle, thrusting protagonist Katniss Everdeen into a brutal arena where alliances are forged and sacrifices are made in a fight against oppression. Gripping and thought-provoking, the narrative explores themes of resilience, morality, and the human spirit's resilience against tyranny.",
    "totalPages": 374,
    "rating": 4.4,
    "category": "Young Adult",
    "tags": ["dystopian", "survival", "television"],
    "publisher": "Scholastic",
    "yearOfPublishing": 2008
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://iili.io/JhpadP4.png",
    "review": "Salinger's seminal work delves into the psyche of disillusioned teenager Holden Caulfield as he grapples with the complexities of adolescence, societal conformity, and the search for authenticity. Through Caulfield's poignant narration, the novel resonates with readers, capturing the universal struggle for identity and belonging amidst a world of perceived phoniness.",
    "totalPages": 224,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["teenage angst", "alienation", "iconic"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://iili.io/Jhpa0xa.png",
    "review": "Harari embarks on a captivating journey through the annals of human history, offering profound insights into the evolutionary forces that shaped Homo sapiens into the dominant species on Earth. With scholarly rigor and accessible prose, the book illuminates the cultural, technological, and cognitive revolutions that define our species' extraordinary trajectory.",
    "totalPages": 443,
    "rating": 4.8,
    "category": "Non-fiction",
    "tags": ["history", "anthropology", "evolution"],
    "publisher": "Harper",
    "yearOfPublishing": 2011
  }
]
